src/Работа_С_Заказами/Catalogs/ВидыОповещенийКлиентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ВидыОповещенийКлиентам</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредназначенаДляSMS</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаРассылокИОповещений</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыРассылокИОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийОповещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредназначенаДляЭлектронныхПисем</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСообщенияSMS</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭлектронногоПисьма</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяУсловиеОтправки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеОтправки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Работа_С_Заказами/Catalogs/ВидыОповещенийКлиентам/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура Работа_С_Заказами_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если О_Работа_С_Заказами.ЭтоПредопределенныйВидОповещения(Объект.Ссылка) Тогда
		Элементы.Наименование.ТолькоПросмотр						= Истина;
		Элементы.ГруппаРассылокИОповещений.ТолькоПросмотр			= Истина;
		Элементы.ТипСобытия.ТолькоПросмотр							= Истина;
		Элементы.ПредназначенаДляЭлектронныхПисем.ТолькоПросмотр	= Истина;
		Элементы.ШаблонЭлектронногоПисьма.ТолькоПросмотр			= Истина;
		Элементы.ПредназначенаДляSMS.ТолькоПросмотр					= Истина;
		Элементы.ШаблонСообщенияSMS.ТолькоПросмотр					= Истина;
		Элементы.ИспользуетсяУсловиеОтправки.Видимость				= Ложь;
		Элементы.ИзменитьФормулу.Видимость							= Ложь;
		Элементы.СтраницаРасписание.Видимость						= Ложь;
		Элементы.СтраницаУсловие.Видимость							= Ложь;
		ЭтотОбъект.КоманднаяПанель.Видимость						= Ложь;
	КонецЕсли;
КонецПроцедуры
